
<html>
<head>
   <title> XXIII Maratona de Programa&ccedil;&atilde;o </title>
</head>
<body bgcolor="#FFFFFF">
&nbsp;
<center>
 <a href="http://icpc.baylor.edu"> <img src="imagens/icpcnovo.png" height=200></a> <p>
 <br> <p> <br> <p> 
 <img SRC="imagens/logomdp.jpg" name="logo">

<p> <br>   <p> 

<h1> <font color=green>  Primeira Fase: 15 de setembro de 2018  <br> 
 Final Brasileira: Salvador, 9 e 10 de novembro de 2018 </font> </h1>  <p> 


</center>


<h1> <img src="imagens/info.gif" align="absmiddle" border=0 width=46
height=38> O que &eacute;? </h1> 

A Maratona de Programa&ccedil;&atilde;o &eacute; um evento da Sociedade Brasileira de Computa&ccedil;&atilde;o
que existe desde o ano de 1996. A Maratona nasceu das competi&ccedil;&otilde;es regionais
classificat&oacute;rias para as finais mundiais do concurso de programa&ccedil;&atilde;o da ACM, o
<a href=http://icpc.baylor.edu> ACM International Collegiate Programming
Contest</a>, e &eacute; parte da regional
sulamericana do concurso. Neste ano ocorre a 23a. edi&ccedil;&atilde;o da Maratona. <p>

Ela se destina a alunos e alunas de cursos de gradua&ccedil;&atilde;o e in&iacute;cio de
p&oacute;s-gradua&ccedil;&atilde;o na &aacute;rea de Computa&ccedil;&atilde;o e afins (Ci&ecirc;ncia da Computa&ccedil;&atilde;o, Engenharia
de Computa&ccedil;&atilde;o, Sistemas de Informa&ccedil;&atilde;o, Matem&aacute;tica, etc). A competi&ccedil;&atilde;o promove
nos estudantes  a criatividade, a capacidade de trabalho em equipe, a busca de
novas solu&ccedil;&otilde;es de software e a habilidade de resolver problemas sob
press&atilde;o. De ano para ano temos observado que as institui&ccedil;&otilde;es e principalmente
as grandes empresas da &aacute;rea t&ecirc;m valorizado os alunos que participam da
Maratona.  <p> 

V&aacute;rias universidades do Brasil desenvolvem concursos locais para escolher os
melhores times para participar da Maratona de Programa&ccedil;&atilde;o. Estes times
competem na Maratona (e portanto na regional sulamericana) de onde os melhores
ser&atilde;o selecionados para participar das Finais Mundiais do evento.  No ano de
2017, cerca de 50 mil estudantes de mais de 3000 escolas de mais de 100 pa&iacute;ses
competiram em regionais em todo o planeta, e apenas 132 (cerca
de 1%) participam das Finais Mundiais do evento, em
Pequim, China.
Sete
times brasileiros, dos mais de 800 participantes, estar&atilde;o presentes nas finais mundiais</a>. <p>

Os times s&atilde;o compostos por tr&ecirc;s estudantes, que tentar&atilde;o resolver durante 5
horas o maior n&uacute;mero poss&iacute;vel dos 10 ou mais problemas que s&atilde;o entregues no
in&iacute;cio da  competi&ccedil;&atilde;o. Estes estudantes t&ecirc;m &agrave; sua disposi&ccedil;&atilde;o apenas um
computador e material 
impresso (livros, listagens, manuais) para vencer a batalha contra o rel&oacute;gio e
os problemas propostos. <p>

Os competidores do time devem colaborar para descobrir os problemas mais
f&aacute;ceis, projetar os testes, e construir as solu&ccedil;&otilde;es que sejam aprovadas pelos
ju&iacute;zes da competi&ccedil;&atilde;o. Alguns problemas requerem apenas compreens&atilde;o, outros
conhecimento de t&eacute;cnicas mais sofisticadas, e alguns podem ser realmente muito
dif&iacute;ceis de serem resolvidos. <p>

O julgamento &eacute; estrito. No in&iacute;cio da competi&ccedil;&atilde;o os competidores recebem os
problemas que devem ser resolvidos. Nos enunciados dos problemas constam
exemplos dos dados dos problemas, mas eles n&atilde;o t&ecirc;m acesso &agrave;s inst&acirc;ncias
testadas pelos ju&iacute;zes. A cada submiss&atilde;o incorreta de um problema (ou seja, que
deu resposta incorreta a uma das inst&acirc;ncias dos ju&iacute;zes) &eacute; atribu&iacute;da uma
penalidade de tempo. O time que conseguir resolver o maior n&uacute;mero de problemas
(no menor tempo acumulado com as penalidades, caso haja empate) &eacute; declarado o
vencedor. <p>



<hr> 
<center> 

<a href="http://www.sbc.org.br"> <img SRC="imagens/sbc.jpg" border=0
    height=100></a> 

</center> 

</body> </html>


