
<html>
<head>
   <title> XXIII Maratona de Programa&ccedil;&atilde;o </title>
</head>
<body bgcolor="#FFFFFF">
&nbsp;
<center>
 <a href="http://icpc.baylor.edu"> <img src="imagens/icpcnovo.png" height=200></a> <p>
 <br> <p> <br> <p> 
 <img SRC="imagens/logomdp.jpg" name="logo">

<p> <br>   <p> 

<h1> <font color=green>  Primeira Fase: 15 de setembro de 2018  <br> 
 Final Brasileira: Salvador, 9 e 10 de novembro de 2018 </font> </h1>  <p> 


</center>


<h1> <img src="imagens/estudo.gif" align="absmiddle" border=0 width=46
height=38> Comit&ecirc; organizador </h1> 

A XXIII Maratona de Programa&ccedil;&atilde;o s&oacute; acontece gra&ccedil;as ao trabalho volunt&aacute;rio de
muitos entusiastas da ideia. A cria&ccedil;&atilde;o da competi&ccedil;&atilde;o foi uma iniciativa dos
professores
<a href=http://www.dcc.ufmg.br/~coelho/> Claudionor Coelho,  </a> <a
href="http://homepages.dcc.ufmg.br/~camarao/" > Carlos Camar&atilde;o </a> 
do Depto de Ci&ecirc;ncia da Computa&ccedil;&atilde;o da UFMG e <a
href=http://www.ic.unicamp.br/~rdahab/> Ricardo Dahab</a>, do IC da
Unicamp.<p>

Nos primeiros anos estiveram envolvidos na organiza&ccedil;&atilde;o Marcus Poggi (PUC-Rio), Ricardo Anido
(IC-Unicamp), Raul Weber (UFRGS), Ricardo Dahab (IC-Unicamp), Katia Guimar&atilde;es
(UFPE), entre outros. <p> 


Desde o ano 2000 o evento passou a ser promovido pela Sociedade Brasileira de
Computa&ccedil;&atilde;o, e o respons&aacute;vel pelo concurso no Brasil &eacute; <a
href=http://www.ime.usp.br/~cef> Carlos E. Ferreira </a> do Depto de Ci&ecirc;ncia
da Computa&ccedil;&atilde;o do IME-USP.

O Comit&ecirc; Diretor da Maratona de Programa&ccedil;&atilde;o &eacute; formado pelos professores:
<ul>
  <li> Fabio Henrique Viduani Martinez, UFMS.
  <li> Liliane Salgado, UFPE.
  <li> Marcus Vinicius Poggi de Arag&atilde;o, PUC-RJ.
  <li> Raul Fernando Weber, UFRGS.
  <li> Rodolfo Jardim de Azevedo, Unicamp.
  <li> Rosiane de Freitas Rodrigues, UFAM.
</ul> <p>

O diretor da  super regi&atilde;o
latino-americana do ICPC a partir de 2018 &eacute; Federico Meza (Universidad de
Talca, Chile) que substituiu  Ricardo Dahab (Unicam) que esteve a frente da
organiza&ccedil;&atilde;o de 1996 a 2017. <p>

O diretor de problemas e chefe dos ju&iacute;zes &eacute; o Prof. Ricardo Anido (IC-Unicamp)
e os Diretores de Sistemas s&atilde;o os Prof. Cassio Campos (Utrecht University) e
Bruno Ribas (UTFPR, Pato Branco). Os diretores da Final Brasileira
da XXIII Maratona de Programa&ccedil;&atilde;o s&atilde;o os Prof. Rubisley Lemes (UFBA), Mauricio
Pamplona Segundo (UFBA) e Caroline
Paim (Centro Universit&aacute;rio SENAI CIMATEC). <p> 

Visite a p&aacute;gina do <a href=http://icpc.baylor.edu> ACM International
Collegiate Programming Contest</a> e a nossa p&aacute;gina no <a
href="http://www.facebook.com/maratona"> Facebook</a>. 

<hr> 
<center> 

<a href="http://www.sbc.org.br"> <img SRC="imagens/sbc.jpg" border=0
    height=100></a> 

</center> 

</body> </html>

