
<html>
<head>
   <title> XXIII Maratona de Programa&ccedil;&atilde;o </title>
</head>
<body bgcolor="#FFFFFF">
&nbsp;
<center>
 <a href="http://icpc.baylor.edu"> <img src="imagens/icpcnovo.png" height=200></a> <p>
 <br> <p> <br> <p> 
 <img SRC="imagens/logomdp.jpg" name="logo">

<p> <br>   <p> 

<h1> <font color=green>  Primeira Fase: 15 de setembro de 2018  <br> 
 Final Brasileira: Salvador, 9 e 10 de novembro de 2018 </font> </h1>  <p> 


</center>


<h1> <img src="imagens/papo.gif" align="absmiddle" border=0 width=46
height=38> Como participar? </h1> 

A Maratona &eacute; dirigida a alunos de cursos superior da &aacute;rea de computa&ccedil;&atilde;o e
afins: Ci&ecirc;ncia da Computa&ccedil;&atilde;o, Engenharia de Computa&ccedil;&atilde;o, Sistemas de
Informa&ccedil;&atilde;o, etc. Cada escola poder&aacute; inscrever mais de um time (veja as <a
href=regras18.html> regras do concurso </a> para mais detalhes). <p>

A Maratona ocorre em duas fases. A primeira fase ser&aacute; eliminat&oacute;ria, e ocorrer&aacute;
simultaneamente no dia <b> 15 de setembro de 2018 </b> em v&aacute;rias sedes
espalhadas por todo o Brasil. Sua institui&ccedil;&atilde;o pode se candidatar para receber
uma sede nesta primeira fase. Para isso, um representante de sua institui&ccedil;&atilde;o
dever&aacute; preencher o <a
href="https://docs.google.com/forms/d/e/1FAIpQLSd-WflhWjFsYZ07i5mEB3oaIwxIduZxDRJP4ILWqT1n2fZTwA/viewform?usp=sf_link">
formul&aacute;rio de inscri&ccedil;&atilde;o </a> at&eacute; <b> 1 de maio de 2018</b>. As sedes aceitas
estar&atilde;o cadastradas at&eacute; o final do m&ecirc;s. A final da XXIII Maratona de Programa&ccedil;&atilde;o
ocorrer&aacute; nos dias 9 e 10 de novembro de 2018 em Salvador, e contar&aacute; com
os  times classificados nas v&aacute;rias sedes na primeira fase. Veja as <a
href=regras18.html> regras do concurso </a> para mais detalhes. <p>

Para efetuar a inscri&ccedil;&atilde;o o time dever&aacute; ter um representante da institui&ccedil;&atilde;o a
que os alunos pertencem, ou algu&eacute;m por ele indicado, que &eacute; o "coach". Este
atestar&aacute; junto &agrave; organiza&ccedil;&atilde;o do concurso que os integrantes dos times de sua
institui&ccedil;&atilde;o atendem os requisitos para participar da competi&ccedil;&atilde;o. Cada time &eacute;
composto por um "coach" (que poder&aacute; ser docente do curso ou dever&aacute; ser
indicado por um docente para este fim), tr&ecirc;s integrantes (veja as <a
href="regras18.html"> regras do concurso </a> para mais detalhes sobre a
elegibilidade de cada integrante) e um reserva. <p>

O coach &eacute; o &uacute;nico interlocutor da equipe junto &agrave; organiza&ccedil;&atilde;o do concurso. Ele
dever&aacute; cadastrar as informa&ccedil;&otilde;es dos membros da equipe no
<a href=http://icpc.baylor.edu> site do ICPC</a> e providenciar o pagamento da
taxa de inscri&ccedil;&atilde;o do time, conforme descrito <a href=inscr18.html> nas informa&ccedil;&otilde;es sobre como
se inscrever</a>. Se todos os procedimentos de inscri&ccedil;&atilde;o n&atilde;o forem realizados
conforme necess&aacute;rio, seu(s) time(s) poder&aacute;(&atilde;o) ser desclassificado(s). &Eacute; muito
importante que a informa&ccedil;&atilde;o no site do ICPC esteja correta!
O coach &eacute; tamb&eacute;m quem poder&aacute; recorrer ao diretor da regional
sulamericana caso considere que algum procedimento prejudicou seu time (veja
as <a href=regras18.html> regras do concurso </a> para mais detalhes). <p>

Se voc&ecirc; deseja competir na Maratona, forme seu time! Procure um professor de
seu curso para que ele ajude voc&ecirc; e seu time sendo o coach, e informe-o dos
procedimentos de inscri&ccedil;&atilde;o. Se voc&ecirc; &eacute; professor de uma institui&ccedil;&atilde;o de ensino
superior da &aacute;rea de computa&ccedil;&atilde;o ou afim, re&uacute;na seus alunos e monte seus times!
Se n&atilde;o tem havido sedes da Maratona na sua regi&atilde;o candidate sua institui&ccedil;&atilde;o
para sediar a Maratona!  Veja <a href=datas18.html> as datas
importantes</a>. N&atilde;o perca os prazos!!! <p>

A final brasileira da competi&ccedil;&atilde;o ocorrer&aacute; em dois dias cheios.  No primeiro
dia ocorre a abertura, a sess&atilde;o de aquecimento e outros eventos importantes. &Eacute;
fundamental a participa&ccedil;&atilde;o dos times neste primeiro dia! No segundo dia ocorre
a competi&ccedil;&atilde;o e a festa de encerramento do concurso. A organiza&ccedil;&atilde;o do concurso
oferecer&aacute; aux&iacute;lio para os times de fora da sede para hospedagem durante as
finais. <p>



<hr> 
<center> 

<a href="http://www.sbc.org.br"> <img SRC="imagens/sbc.jpg" border=0
    height=100></a> 

</center> 

</body> </html>
