
<html>
<head>
   <title> XXIII Maratona de Programa&ccedil;&atilde;o </title>
</head>
<body bgcolor="#FFFFFF">
&nbsp;
<center>
 <a href="http://icpc.baylor.edu"> <img src="imagens/icpcnovo.png" height=200></a> <p>
 <br> <p> <br> <p> 
 <img SRC="imagens/logomdp.jpg" name="logo">

<p> <br>   <p> 

<h1> <font color=green>  Primeira Fase: 15 de setembro de 2018  <br> 
 Final Brasileira: Salvador, 9 e 10 de novembro de 2018 </font> </h1>  <p> 


</center>

<h1> <img src="imagens/livros.gif" align="absmiddle" border="0" width="46" height="38"> Regras  </h1>

<b> <font color="red"> Estas regras foram aprovadas pelo Comit&ecirc; Diretor
da Maratona de Programa&ccedil;&atilde;o para vigorarem a partir do ano de
2015. As mesmas regras se mant&ecirc;m em 2018.
</font> </b>


<h2> Forma&ccedil;&atilde;o dos times </h2>

Os times representam institui&ccedil;&otilde;es de ensino superior,
aqui chamadas de <b> escolas</b>. Uma escola &eacute; definida pela
institui&ccedil;&atilde;o de ensino superior e a cidade de onde
v&ecirc;m os alunos participantes do time. Assim, por exemplo, a USP
poder&aacute; ter times de v&aacute;rias escolas: USP-S&atilde;o
Paulo, USP-S&atilde;o Carlos, etc. A Unicamp poder&aacute; ter times
de: Unicamp-Campinas, Unicamp-Limeira, etc. No caso de um
curso a dist&acirc;ncia, a 
escola poder&aacute; ser definida pela institui&ccedil;&atilde;o de ensino superior e o polo de
onde prov&ecirc;m os estudantes ou, no caso do time combinar alunos de v&aacute;rios polos,
a institui&ccedil;&atilde;o de ensino superior e o adjetivo "virtual" para caracterizar que
s&atilde;o alunos de EAD.  <p> 

Os times s&atilde;o formados por um coach e tr&ecirc;s alunos regularmente matriculados
desta 
institui&ccedil;&atilde;o. Uma mesma institui&ccedil;&atilde;o pode
ter v&aacute;rios times participantes da primeira fase do
concurso. Todos os times de uma instituti&ccedil;&atilde;o devem
disputar a primeira fase em uma mesma sede. A aceita&ccedil;&atilde;o
de mais de dois times de uma escola est&aacute; sujeita &agrave;
capacidade da sede em que a inscri&ccedil;&atilde;o se realiza e
ser&aacute; atendida por ordem de chegada. <p>

O concurso se destina a alunos de institui&ccedil;&otilde;es superiores tipicamente da &aacute;rea
de computa&ccedil;&atilde;o (Ci&ecirc;ncia da Computa&ccedil;&atilde;o, Engenharia de Computa&ccedil;&atilde;o, Sistemas de
Informa&ccedil;&atilde;o, etc) e &aacute;reas afins (Matem&aacute;tica, F&iacute;sica e Engenharia). N&atilde;o h&aacute;
impedimentos &agrave; participa&ccedil;&atilde;o de alunos de outros cursos.  O coach ser&aacute; o
representante do time junto &agrave; organiza&ccedil;&atilde;o do concurso e <b> dever&aacute; ser um docente
desta escola ou poder&aacute; ser indicado (atrav&eacute;s deste <a
href="carta-coach18.pdf" target="_blank"> formul&aacute;rio</a>) para a fun&ccedil;&atilde;o
por um representante desta escola</b>. O mesmo coach poder&aacute; representar v&aacute;rios
times da escola. Uma mesma escola pode ter v&aacute;rios coaches. <b> Os times da
escola dever&atilde;o ser inscritos na sede da primeira fase definida para sua regi&atilde;o
geogr&aacute;fica pelo Comit&ecirc; Diretor do concurso</b>. O coach poder&aacute; solicitar uma
mudan&ccedil;a de sede ao comit&ecirc; diretor. Todos os times da escola devem competir na
mesma sede. <p>

Cada time &eacute; composto por tr&ecirc;s alunos e, no m&aacute;ximo,
um reserva. Todos devem ser alunos regulares de cursos de
gradua&ccedil;&atilde;o ou p&oacute;s-gradua&ccedil;&atilde;o da
escola. A participa&ccedil;&atilde;o do reserva no concurso se
dar&aacute; apenas em caso de algum problema ocorrer com um dos
participantes antes da realiza&ccedil;&atilde;o do concurso, e a
substitui&ccedil;&atilde;o dever&aacute; ser comunicada ao
Comit&ecirc; Diretor da XXIII Maratona de Programa&ccedil;&atilde;o <b>
at&eacute;, no m&aacute;ximo, a v&eacute;spera da
competi&ccedil;&atilde;o</b>. Depois de iniciado o concurso n&atilde;o
h&aacute; possibilidade de substitui&ccedil;&otilde;es no time. <b> Um
time com dois ou menos componentes n&atilde;o poder&aacute; se
qualificar &agrave;s fases posteriores da Maratona de
Programa&ccedil;&atilde;o. Assim, se algo ocorrer com um dos
tr&ecirc;s componentes de um time sem reserva, este time fica
desqualificado.</b>  <p>

Um time &eacute; eleg&iacute;vel se todos os seus membros (competidores e reserva)
satisfizerem a condi&ccedil;&atilde;o abaixo:
<ul>
  <li>cada membro, antes desta competi&ccedil;&atilde;o, pode ter
      participado de <b> no m&aacute;ximo uma final mundial </b> do
      ICPC da ACM, de no m&aacute;ximo <font color="red"> <b> 4
      (quatro) </b> </font> regionais sul-americanas do concurso (ou
      seja, da Maratona de Programa&ccedil;&atilde;o) e deve ter
      iniciado seus estudos universit&aacute;rios no ano de <b>
      2014 </b> ou anos posteriores (a contar do in&iacute;cio do
      primeiro curso universit&aacute;rio do aluno, <font color=red> mesmo que n&atilde;o
      tenha completado este curso</font>), ou ter <b>  nascido em 1995 </b> ou
      anos posteriores. 
</li></ul>
Assim, por exemplo, se voc&ecirc; iniciou seu primeiro curso superior
em 2017, pode participar, mesmo que tenha nascido em 1993. Outro
exemplo, se voc&ecirc; nasceu em 1995 pode participar, mesmo
tendo iniciado sua gradua&ccedil;&atilde;o em 2012. <p>

Apresentamos abaixo <b>  novamente </b> as regras, agora em forma de um
&quot;programa&quot; para verificar se o competidor &eacute; ou n&atilde;o
eleg&iacute;vel:
<ul>
  <li> <font color="green"> [regras de
  participa&ccedil;&atilde;o] </font> <br>
       <b> se </b> <br> o competidor j&aacute; participou de duas
      finais mundiais, <font color="red"> <b> ele n&atilde;o &eacute;
      eleg&iacute;vel </b> </font> <p>
       <b> se </b> <br> o competidor j&aacute; participou de <b>
      cinco </b> regionais, <font color="red">
       <b> ele n&atilde;o &eacute; eleg&iacute;vel </b> </font> <p> 
  <li> <font color="green"> [per&iacute;odo de elegibilidade] </font> <br>
       <b> se </b> o competidor iniciou seus estudos
       universit&aacute;rios no ano 2013 ou anos anteriores <b> E </b>
       o competidor nasceu em 1994 ou anos anteriores),
       <font color="red"> <b> ele n&atilde;o &eacute;
       eleg&iacute;vel; </b> </font> <p>
  <li> <b> caso contr&aacute;rio, </b> <font color="green"> o competidor
  &eacute; eleg&iacute;vel.</font>
</li></p></li></p></p></li></ul>
<p>


<font color="red"> <b> ATEN&Ccedil;&Atilde;O: </b> </font> Conforme
descrito nas
<a href="http://cm2prod.baylor.edu/ICPCWiki/Wiki.jsp?page=Regional%20Rules#section-Regional+Rules-PeriodOfEligibility" target="_blank">
as regras das regionais do ICPC </a> h&aacute; a possibilidade de, em
casos excepcionais (afastamentos por motivo de sa&uacute;de,
servi&ccedil;o militar, etc) ser concedido uma extens&atilde;o no
per&iacute;odo de elegibilidade de um competidor. Para isso o coach
dever&aacute; encaminhar um pedido ao comit&ecirc; de elegibilidade do
ICPC. No par&aacute;grafo abaixo (extra&iacute;do das regras do ICPC)
est&aacute; descrito como o coach deve proceder: <p>

<i> To make such a request, the coach must petition the <a href="mailto:manager@icpc.baylor.edu?subject=Contestant" target="_blank"> ICPC Eligibility
Committee </a> at least three weeks before the regional contest. The ICPC
Eligibility Committee will render a decision within five business days.</i>
<p> 

  Caso seu pedido seja atendido, envie uma c&oacute;pia da
  mensagem do Comit&ecirc; de Elegibilidade do ICPC ao <a
  href="mailto:maratonadeprogramacaosbc@gmail.com" target="_blank"> Comit&ecirc;
  Diretor da Maratona</a>. <p>  

Em caso de d&uacute;vida, entre em contato com o
Comit&ecirc; Diretor da Maratona. 


<h2> Inscri&ccedil;&atilde;o de times e classifica&ccedil;&atilde;o para a final brasileira </h2> 


<ul> 

<li> Sede da primeira fase <p> 

Ap&oacute;s a defini&ccedil;&atilde;o das sedes da primeira fase o comit&ecirc; definir&aacute; a regi&atilde;o
geogr&aacute;fica coberta por cada sede. Dessa forma, cada institui&ccedil;&atilde;o dever&aacute;
inscrever seus times na sede designada pelo comit&ecirc;. A institui&ccedil;&atilde;o poder&aacute;
solicitar ao comit&ecirc; uma mudan&ccedil;a de sede. Se n&atilde;o for autorizada, o time pode
concorrer na sede desejada disputando apenas a vagas das regras <b> 1 </b> e
<b> 3 </b> definidas a seguir.

<li> Aloca&ccedil;&atilde;o de vagas na final brasileira <p> 

As vagas na final brasileira ser&atilde;o de tr&ecirc;s tipos, conforme
descrito abaixo. Um time s&oacute; se qualifica para passar &agrave; final
brasileira caso tenha resolvido pelo menos <b> dois </b> problemas na
prova da primeira fase. Al&eacute;m disso, uma mesma escola pode ter no
m&aacute;ximo dois times na final brasileira.

<ul> 
  <li> <font color="red"> <b> [regra 1] </b> </font> cerca de 25% das
      vagas ser&atilde;o atribu&iacute;das aos times com melhor
      desempenho por todas as sedes. Uma sede se qualifica para vagas
      deste tipo se tiver times de pelo menos 2 escolas. <p>
       <p> 

  <li> <font color="red"> <b> [regra 2] </b> </font> cerca de 65% das
      vagas ser&atilde;o distribu&iacute;das entre as sedes de acordo
      com o n&uacute;mero de <b> escolas </b> participantes naquela
      sede atrav&eacute;s da f&oacute;rmula:
      <p>
      <center>   
      N&uacute;merodeVagas = arredonda(VagasRegra2 * NumerodeEscolasnaSede / TotaldeEscolas).
      </center> 
      <p>
      Uma sede se qualifica para vagas deste tipo se tiver pelo
      menos <font color=red> <b> 10 times </b> de <b> 5 escolas</b></font>. <p> 

  <li> <font color="red"> <b> [regra 3] </b> </font> cerca de 10% das
      vagas ser&atilde;o atribu&iacute;das entre as sedes pelo
      Comit&ecirc; Diretor da Maratona de Programa&ccedil;&atilde;o
      sob forma de incentivo ao crescimento de sedes ainda n&atilde;o
      contempladas, ou por outros crit&eacute;rios que ser&atilde;o
      divulgados na ocasi&atilde;o da defini&ccedil;&atilde;o dos
      times participantes da final. <p>
</ul>
</ul> 

As porcentagens acima indicam o n&uacute;mero aproximado de vagas de
cada tipo. As vagas n&atilde;o usadas por uma das regras ser&atilde;o distribu&iacute;das
automaticamente entre as demais, a crit&eacute;rio do comit&ecirc; diretor da
Maratona de Programa&ccedil;&atilde;o.<p>

Uma mesma escola pode classificar dois times para a final
brasileira apenas no caso de ambos os times classificarem-se pela regra 1. <p>

<h3> Forma&ccedil;&atilde;o das supersedes </h3>

As sedes que n&atilde;o atingirem o limiar (<b>10 times e 5 escolas</b>) para fins de
distribui&ccedil;&atilde;o das vagas pela regra 2 s&atilde;o agrupadas:
<ul>
  <li> em uma supersede estadual, que junta as sedes do mesmo estado que n&atilde;o
      atingiram o limiar. Se ainda n&atilde;o atingirem o m&iacute;nimo, s&atilde;o agrupadas
  <li> em uma supersede regional, que junta as supersedes estaduais da mesma
  regi&atilde;o, que ainda n&atilde;o atingiram o limite. Se ainda assim n&atilde;o atingem o
  m&iacute;nimo, s&atilde;o agrupadas
  <li> em uma supersede nacional.
</ul>

Estas supersedes receber&atilde;o vagas na final brasileira utilizando a f&oacute;rmula
descrita na regra 2 acima. <p> 

<font color=red>
<h3> Corre&ccedil;&atilde;o centralizada </h3>

<b> 
Neste ano vamos utilizar novamente a corre&ccedil;&atilde;o centralizada. Todas as sedes
dever&atilde;o participar, mas dever&atilde;o manter um esquema alternativo de corre&ccedil;&atilde;o
das submiss&otilde;es para o caso de algum problema ocorrer.

</b> <p>
</font> 

</ul>

<h2> Formato do concurso </h2>

Em cada uma das fases da Maratona de Programa&ccedil;&atilde;o os times receber&atilde;o uma prova
com diversos problemas que devem ser resolvidos durante 5 horas de
competi&ccedil;&atilde;o. A prova da final brasileira ser&aacute; escrita em ingl&ecirc;s. A prova da
primeira fase poder&aacute; ser em portugu&ecirc;s. Os problemas dever&atilde;o ser resolvidos em
alguma das linguagens de programa&ccedil;&atilde;o dispon&iacute;veis. Na final brasileira os
programas dever&atilde;o ser feitos em C, C++, python ou Java. Na primeira fase, o
diretor da sede poder&aacute; solicitar a inclus&atilde;o de outras linguagens de
programa&ccedil;&atilde;o, que ser&aacute; julgado pela organiza&ccedil;&atilde;o.
Os times poder&atilde;o resolver um problema da prova em uma linguagem
de programa&ccedil;&atilde;o e um outro problema em outra linguagem, sem qualquer
preju&iacute;zo. Para a implementa&ccedil;&atilde;o os times ter&atilde;o &agrave; sua disposi&ccedil;&atilde;o um computador e
todo o material escrito que desejarem. Entretanto, n&atilde;o poder&atilde;o fazer uso de
material armazenado em meio digital ou ter acesso &agrave; Internet durante a
competi&ccedil;&atilde;o. <p>

Quando um time julgar que tem um programa que resolve um problema, ele pode
submet&ecirc;-lo &agrave; corre&ccedil;&atilde;o dos ju&iacute;zes, que compilam e executam este programa para
uma bateria de testes desconhecida dos times. Um problema &eacute; considerado
resolvido se, para todos os testes da bateria, ele devolve o resultado
esperado pelos ju&iacute;zes. Para cada submiss&atilde;o o time recebe uma resposta, que
pode ser satisfat&oacute;ria (e o problema est&aacute; resolvido pelo time) ou indica algum
erro ocorrido, como: resposta errada, tempo de execu&ccedil;&atilde;o excedido, erro de
execu&ccedil;&atilde;o, erro de compila&ccedil;&atilde;o, etc.<p>

O time vencedor &eacute; aquele que resolve a maior quantidade de
problemas nas 5 horas de competi&ccedil;&atilde;o. Empates no
n&uacute;mero de problemas resolvidos s&atilde;o classificados pelo
tempo corrigido. Ganha aquele que tem o menor tempo corrigido. O tempo
corrigido do time &eacute; dado pela soma dos tempos corrigidos
somente dos problemas corretamente resolvidos pelo time. O tempo
corrigido de um problema &eacute; dado pelo n&uacute;mero de minutos
decorridos desde o in&iacute;cio da competi&ccedil;&atilde;o
at&eacute; o momento da primeira submiss&atilde;o correta somado com
uma penalidade de 20 minutos por submiss&atilde;o incorreta feita
anteriormente neste problema. Em caso de empate, ser&aacute;
considerado vencedor o time cuja &uacute;ltima submiss&atilde;o
correta tenha sido feita mais cedo.  Persistindo o empate,
passar&aacute; &agrave; pen&uacute;ltima submiss&atilde;o correta e
assim por diante. Se persistir o empate a organiza&ccedil;&atilde;o
far&aacute; um sorteio entre os times envolvidos. <p>

A organiza&ccedil;&atilde;o da competi&ccedil;&atilde;o &eacute;
respons&aacute;vel pela decis&atilde;o de qualquer caso n&atilde;o
previsto. Os times inscritos permitem o uso e divulga&ccedil;&atilde;o
de suas imagens e dos programas submetidos pela
organiza&ccedil;&atilde;o da competi&ccedil;&atilde;o. <p>

<h2> Premia&ccedil;&atilde;o e qualifica&ccedil;&atilde;o para as finais mundiais </h2>

A Maratona de Programa&ccedil;&atilde;o da SBC oferece medalhas aos
dez primeiros colocados na fase final da competi&ccedil;&atilde;o:
ouro para os tr&ecirc;s primeiros; prata para o quarto, quinto e
sexto; e bronze para o s&eacute;timo a d&eacute;cimo
lugares. Al&eacute;m disso, o time campe&atilde;o recebe uma
c&oacute;pia do trof&eacute;u &quot;Maratona de
Programa&ccedil;&atilde;o&quot;. <p>

O time campe&atilde;o da Maratona de Programa&ccedil;&atilde;o garante
vaga nas finais mundiais do concurso de programa&ccedil;&atilde;o da
ACM. Caso o Brasil receba outras vagas nas finais da
competi&ccedil;&atilde;o, estas ser&atilde;o ocupadas pelos primeiros
colocados da final brasileira, respeitado o limite de uma vaga por
escola, conforme regra do ICPC.<p>

Os times classificados para a final mundial do ICPC ser&atilde;o
convidados a participar de um ou mais treinamentos, oportunamente
anunciados. <p>

<h2> Recursos </h2>

Apenas o coach do time poder&aacute; recorrer &agrave;
organiza&ccedil;&atilde;o do evento caso julgue que seu time tenha
sido prejudicado durante a competi&ccedil;&atilde;o. Qualquer recurso
deve ser inicialmente enviado ao <a
href="mailto:maratonadeprogramacaosbc@gmail.com" target="_blank"> 
diretor da Maratona de Programa&ccedil;&atilde;o</a> <b> dentro de
dois dias &uacute;teis </b> a contar do dia da
realiza&ccedil;&atilde;o do concurso. O <a href="organizacao18.html" target="_blank">
Comit&ecirc; Diretor da Maratona de Programa&ccedil;&atilde;o</a>
decidir&aacute; sobre o caso nos tr&ecirc;s dias &uacute;teis
seguintes. O Comit&ecirc; Diretor da Maratona de
Programa&ccedil;&atilde;o encaminhar&aacute; o recurso e a
decis&atilde;o local ao diretor da super-regi&atilde;o
Latino-Americana do ICPC. Os resultados da Maratona de
Programa&ccedil;&atilde;o ser&atilde;o finais apenas quando todos os
recursos tiverem sido julgados. <p>

Um recurso deve estar baseado em uma ou mais das circunst&acirc;ncias
a seguir: viola&ccedil;&atilde;o de uma regra, m&aacute; conduta de um
time ou m&aacute; conduta da administra&ccedil;&atilde;o do concurso
com inten&ccedil;&atilde;o de prejudicar. As decis&otilde;es dos
ju&iacute;zes s&atilde;o finais. N&atilde;o cabe recurso quanto a
julgamento de problemas. <p>

<hr> 

Qualquer d&uacute;vida a respeito das regras deve ser encaminhada
<a href="mailto:maratonadeprogramacaosbc@gmail.com" target="_blank"> ao Comit&ecirc;
Diretor da Maratona de Programa&ccedil;&atilde;o</a>.


<hr> 
<center> 

<a href="http://www.sbc.org.br"> <img SRC="imagens/sbc.jpg" border=0
    height=100></a> 

</center> 

</body> </html>


