<html>
<head>
   <title> XXIII Maratona de Programa&ccedil;&atilde;o </title>
  <link rel="stylesheet" href="https://stackpath.bootstrapcdn.com/bootstrap/4.3.1/css/bootstrap.min.css"
    integrity="sha384-ggOyR0iXCbMQv3Xipma34MD+dH/1fQ784/j6cY/iJTQUOhcWr7x9JvoRxT2MZw1T" crossorigin="anonymous">
  <link rel="stylesheet" type="text/css" href="styles.css">
  <link rel="stylesheet" href="https://use.fontawesome.com/releases/v5.7.2/css/all.css"
    integrity="sha384-fnmOCqbTlWIlj8LyTjo7mOUStjsKC4pOpQbqyi7RrhN7udi9RwhKkMHpvLbHG9Sr" crossorigin="anonymous">
</head>
<body>

  <script language="javascript" type="text/javascript" charset="utf-8" src="header.js"></script>
  <div class="container">
    <h1> <img height=150 src="wf18/2018logo.jpg"> Participa&ccedil;&atilde;o na Final Mundial do ICPC </h2>

  Classificaram-se para participar da Final Mundial do ICPC, na cidade de
  Pequim, China, de 15 a 20 de abril de 2018 as seguintes universidades:
  <ul>
    <li> <a href="wf18/ime.jpg"> Instituto Militar de Engenharia </a> 
    <li> <a href="wf18/usp-sc.jpg"> Universidade de S&atilde;o Paulo - S&atilde;o Carlos </a> 
    <li> <a href="wf18/usp.jpg"> Universidade de S&atilde;o Paulo - S&atilde;o Paulo </a> 
    <li> <a href="wf18/ufcg.jpg"> Universidade Federal de Campina Grande </a> 
    <li> <a href="wf18/ufpe.jpg"> Universidade Federal de Pernambuco </a> 
    <li> <a href="wf18/ufrj.jpg"> Universidade Federal do Rio de Janeiro </a> 
    <li> <a href="wf18/ufrn.jpg"> Universidade Federal do Rio Grande do Norte </a> 
  </ul> 
    
  Durante a final mundial, os l&iacute;deres da competi&ccedil;&atilde;o na Am&eacute;rica Latina
  reuniram-se para discutir como ser&aacute; a organiza&ccedil;&atilde;o nos pr&oacute;ximos anos, e a
  possibilidade de criar uma final latino-americana da competi&ccedil;&atilde;o. A reuni&atilde;o
  marcou a transi&ccedil;&atilde;o no comando da super-regi&atilde;o latino-americana. Depois de mais
  de 20 anos a frente da regi&atilde;o, o Prof. Ricardo Dahab (Unicamp) afastou-se da
  competi&ccedil;&atilde;o e foi substitu&iacute;do por Federico Meza (Universidade de Talca).
  <p>
  <center>
  <img height=500 src="wf18/diretores.jpg">
  </center>
  <p>

  Uma das atividades da final foi uma visita &agrave; Muralha da China, quando times e
  staff tiveram a oportunidade de conhecer esta maravilha do mundo.
  <p>
  <center>
  <img height=500 src="wf18/muralha1.jpg">
  <img height=500 src="wf18/muralha2.jpg">
  </center>
  <p>
  As equipes brasileiras tiveram um excelente desempenho na competi&ccedil;&atilde;o. No <a
  href="wf18/Results 2018.pdf">  placar final </a> temos os times do IME, UFCG e
  UFPE com men&ccedil;&atilde;o honrosa tendo resolvido 3 problemas; USP-S&atilde;o Carlos, UFRN e
  UFRJ na 56a. posi&ccedil;&atilde;o, com 4 problemas e o <a href="wf18/lachamps.jpg"> time da
  USP </a> na 14a. posi&ccedil;&atilde;o, com 6 problemas. O time da USP sagrou-se campe&atilde;o
  latino-americano nesta final. Foi a terceira vez que um time da USP alcan&ccedil;ou
  este feito. O placar geral com os desempates pode ser conferido neste <a
  href="wf18/Scoreboard.pdf"> link.</a>
  <p>
  Abaixo a tradicional foto com todos os times brasileiros na final. 

  <p>
  <center>
  <img src="wf18/brasileiros.jpg">
  </center>
  <p>

  </div>
  </main>
</div>
  <script language="javascript" type="text/javascript" charset="utf-8" src="footer.js"></script>
</body> </html>

